<a href="https://colab.research.google.com/github/Khushitha/INTERNSOFTcodefiles/blob/main/Pandas_Tutorial.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# ***Pandas***

In [1]:
import pandas

In [2]:
pandas.__version__

'1.1.5'

***Pandas Objects***

In [3]:
import numpy as np
import pandas as pd

***Series***

A Series is a single vector of data (like a NumPy array) with an index that labels each element in the vector.

In [4]:
counts = pd.Series([10, 20, 30, 40, 50, 60, 70])
counts

0    10
1    20
2    30
3    40
4    50
5    60
6    70
dtype: int64

In [5]:
counts.values

array([10, 20, 30, 40, 50, 60, 70])

In [6]:
counts.index

RangeIndex(start=0, stop=7, step=1)

In [7]:
planets = pd.Series([1, 2, 3, 4, 5, 6, 7, 8], 
    index=['Mercury', 'Venus', 'Earth', 'Mars', 'Jupiter', 'Saturn', 'Uranus', 'Neptune'])

planets

Mercury    1
Venus      2
Earth      3
Mars       4
Jupiter    5
Saturn     6
Uranus     7
Neptune    8
dtype: int64

In [8]:
planets['Earth']

3

In [9]:
planets = pd.Series(['Mercury', 'Venus', 'Earth', 'Mars', 'Jupiter', 'Saturn', 'Uranus', 'Neptune'], 
    index=[i for i in range(1, 9)])

planets

1    Mercury
2      Venus
3      Earth
4       Mars
5    Jupiter
6     Saturn
7     Uranus
8    Neptune
dtype: object

In [10]:
planets[3]

'Earth'

In [11]:
planets.name = 'Planets'
planets.index.name = 'position'
planets

position
1    Mercury
2      Venus
3      Earth
4       Mars
5    Jupiter
6     Saturn
7     Uranus
8    Neptune
Name: Planets, dtype: object

In [12]:
planets.index

Int64Index([1, 2, 3, 4, 5, 6, 7, 8], dtype='int64', name='position')

In [13]:
planets = pd.Series([1, 2, 3, 4, 5, 6, 7, 8], 
    index=['Mercury', 'Venus', 'Earth', 'Mars', 'Jupiter', 'Saturn', 'Uranus', 'Neptune'])

planets.name = 'Planets Positions'
planets.index.name = 'Planet names'
planets

Planet names
Mercury    1
Venus      2
Earth      3
Mars       4
Jupiter    5
Saturn     6
Uranus     7
Neptune    8
Name: Planets Positions, dtype: int64

In [14]:
np.log(planets)

Planet names
Mercury    0.000000
Venus      0.693147
Earth      1.098612
Mars       1.386294
Jupiter    1.609438
Saturn     1.791759
Uranus     1.945910
Neptune    2.079442
Name: Planets Positions, dtype: float64

In [15]:
planets[planets > 4]

Planet names
Jupiter    5
Saturn     6
Uranus     7
Neptune    8
Name: Planets Positions, dtype: int64

In [16]:
planets_dict = {'Mercury' : 1, 'Venus' : 2, 'Earth' : 3, 'Mars' : 4, 'Jupiter' : 5}
print(planets_dict)
pd.Series(planets_dict)

{'Mercury': 1, 'Venus': 2, 'Earth': 3, 'Mars': 4, 'Jupiter': 5}

Mercury    1
Venus      2
Earth      3
Mars       4
Jupiter    5
dtype: int64

***DataFrame***

A DataFrame represents a tabular, spreadsheet-like data structure containing an ordered collection of columns, each of which can be a different value type (numeric, string, boolean, etc).

In [17]:
df = {"Province": ["FL", "FL", "NH", "NH", "ZH"],
        "Year": [2013, 2014, 2013, 2014, 2014],
        "Literacy": [0.2, 0.1, 0.5, 0.3, 0.5]}
print(df)
df = pd.DataFrame(df)
df

{'Province': ['FL', 'FL', 'NH', 'NH', 'ZH'], 'Year': [2013, 2014, 2013, 2014, 2014], 'Literacy': [0.2, 0.1, 0.5, 0.3, 0.5]}

  Province  Year  Literacy
0       FL  2013       0.2
1       FL  2014       0.1
2       NH  2013       0.5
3       NH  2014       0.3
4       ZH  2014       0.5

In [18]:
df = pd.DataFrame(data, columns=["Year", "Province" ,"Literacy"])
df

NameError: ignored

In [19]:
df = pd.DataFrame(df, columns=["Province", "Year" ,"Literacy"])
df

  Province  Year  Literacy
0       FL  2013       0.2
1       FL  2014       0.1
2       NH  2013       0.5
3       NH  2014       0.3
4       ZH  2014       0.5

In [20]:
df['year/literacy'] = df.Year / df.Literacy
df

  Province  Year  Literacy  year/literacy
0       FL  2013       0.2   10065.000000
1       FL  2014       0.1   20140.000000
2       NH  2013       0.5    4026.000000
3       NH  2014       0.3    6713.333333
4       ZH  2014       0.5    4028.000000

In [21]:
df['Series'] = pd.Series(range(5), index=[0, 1, 2, 3, 4])
df

  Province  Year  Literacy  year/literacy  Series
0       FL  2013       0.2   10065.000000       0
1       FL  2014       0.1   20140.000000       1
2       NH  2013       0.5    4026.000000       2
3       NH  2014       0.3    6713.333333       3
4       ZH  2014       0.5    4028.000000       4

In [22]:
df['Series'] = pd.Series(range(10), index=[0, 1, 2, 3, 4])
df

ValueError: ignored

In [23]:
df['Series'] = pd.Series(range(10), index=[i for i in range(10)])
df

  Province  Year  Literacy  year/literacy  Series
0       FL  2013       0.2   10065.000000       0
1       FL  2014       0.1   20140.000000       1
2       NH  2013       0.5    4026.000000       2
3       NH  2014       0.3    6713.333333       3
4       ZH  2014       0.5    4028.000000       4

In [24]:
df.to_dict()

{'Literacy': {0: 0.2, 1: 0.1, 2: 0.5, 3: 0.3, 4: 0.5},
 'Province': {0: 'FL', 1: 'FL', 2: 'NH', 3: 'NH', 4: 'ZH'},
 'Series': {0: 0, 1: 1, 2: 2, 3: 3, 4: 4},
 'Year': {0: 2013, 1: 2014, 2: 2013, 3: 2014, 4: 2014},
 'year/literacy': {0: 10065.0,
  1: 20140.0,
  2: 4026.0,
  3: 6713.333333333334,
  4: 4028.0}}

In [25]:
df

  Province  Year  Literacy  year/literacy  Series
0       FL  2013       0.2   10065.000000       0
1       FL  2014       0.1   20140.000000       1
2       NH  2013       0.5    4026.000000       2
3       NH  2014       0.3    6713.333333       3
4       ZH  2014       0.5    4028.000000       4

In [26]:
pd.DataFrame(df.to_dict())

  Province  Year  Literacy  year/literacy  Series
0       FL  2013       0.2   10065.000000       0
1       FL  2014       0.1   20140.000000       1
2       NH  2013       0.5    4026.000000       2
3       NH  2014       0.3    6713.333333       3
4       ZH  2014       0.5    4028.000000       4

In [27]:
data = [{'a': i, '(a * 10)': 10 * i, '(a * 20)' : 20 * i} for i in range(6)]
print(data)
pd.DataFrame(data)

[{'a': 0, '(a * 10)': 0, '(a * 20)': 0}, {'a': 1, '(a * 10)': 10, '(a * 20)': 20}, {'a': 2, '(a * 10)': 20, '(a * 20)': 40}, {'a': 3, '(a * 10)': 30, '(a * 20)': 60}, {'a': 4, '(a * 10)': 40, '(a * 20)': 80}, {'a': 5, '(a * 10)': 50, '(a * 20)': 100}]

   a  (a * 10)  (a * 20)
0  0         0         0
1  1        10        20
2  2        20        40
3  3        30        60
4  4        40        80
5  5        50       100

In [28]:
pd.DataFrame([{'a': 1, 'b': 2}, {'b': 3, 'c': 4, 'd': 5}])

     a  b    c    d
0  1.0  2  NaN  NaN
1  NaN  3  4.0  5.0

In [29]:
pd.DataFrame(np.random.randint(1, 100),
             columns=['first', 'second'],
             index=['a', 'b', 'c'])

   first  second
a     15      15
b     15      15
c     15      15

In [30]:
pd.DataFrame([[np.random.randint(i, i * 10) for i in range(1, 3)], 
              [np.random.randint(i, i * 10) for i in range(1, 3)], 
              [np.random.randint(i, i * 10) for i in range(1, 3)]],
             columns=['first', 'second'],
             index=['a', 'b', 'c'])

   first  second
a      2      13
b      6      14
c      9      11

***Pandas Index Object***

In [31]:
ind = pd.Index([2, 3, 5, 7, 11, 13, 17])
ind

Int64Index([2, 3, 5, 7, 11, 13, 17], dtype='int64')

In [32]:
ind[2]

5

In [33]:
ind[::-1]

Int64Index([17, 13, 11, 7, 5, 3, 2], dtype='int64')

In [34]:
ind[1:5]

Int64Index([3, 5, 7, 11], dtype='int64')

In [35]:
ind[0] = 1 #error ind is immutable

TypeError: ignored

In [36]:
print(ind.size, ind.shape, ind.ndim, ind.dtype)

7 (7,) 1 int64

***Ufuncs: Index Preservation***

In [37]:
rndSt = np.random.RandomState(10)
ser = pd.Series(rndSt.randint(0, 10, 7))
ser

0    9
1    4
2    0
3    1
4    9
5    0
6    1
dtype: int64

In [38]:
rndSt = np.random.RandomState(15)
ser = pd.Series(rndSt.randint(0, 10, 7))
ser

0    8
1    5
2    5
3    7
4    0
5    7
6    5
dtype: int64

In [39]:
dfr = pd.DataFrame(rndSt.randint(0, 10, (5, 4)),
                  columns=['A', 'B', 'C', 'D'])
dfr

   A  B  C  D
0  6  1  7  0
1  4  9  7  5
2  3  6  8  2
3  1  1  0  5
4  2  2  1  8

In [40]:
dfr = pd.DataFrame(rndSt.randint(1, 20, (6, 5)),
                  columns=['A', 'B', 'C', 'D', 'E'])
dfr

    A   B   C   D   E
0   7  10   3   9   9
1  16   4   5   8   3
2  11   1   6   8   6
3  14  18  17   9  13
4  15  13   2   3  13
5  11  18   3  19  17

In [41]:
np.exp(ser)

0    2980.957987
1     148.413159
2     148.413159
3    1096.633158
4       1.000000
5    1096.633158
6     148.413159
dtype: float64

In [42]:
np.exp(dfr * np.pi / 6)

             A             B            C             D            E
0    39.063613    187.914629     4.810477    111.317778   111.317778
1  4348.474659      8.120527    13.708196     65.942965     4.810477
2   317.217143      1.688092    23.140693     65.942965    23.140693
3  1525.965889  12391.647808  7340.624393    111.317778   903.959070
4  2575.970497    903.959070     2.849654      4.810477   903.959070
5   317.217143  12391.647808     4.810477  20918.238991  7340.624393

***Universal Functions: Index Alignment***

In [43]:
area = pd.Series({'Alaska': 123425, 'Texas': 813481,
                  'California': 123782}, name='area')
population = pd.Series({'California': 302804, 'Texas': 287954,
                        'New York': 98754}, name='population')
print(area, end="\n\n")
print(population)

Alaska        123425
Texas         813481
California    123782
Name: area, dtype: int64

California    302804
Texas         287954
New York       98754
Name: population, dtype: int64

In [44]:
population / area

Alaska             NaN
California    2.446268
New York           NaN
Texas         0.353978
dtype: float64

In [45]:
area.index | population.index

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [46]:
area.index & population.index

Index(['Texas', 'California'], dtype='object')

In [47]:
for i in area.index & population.index:
  print(i + " : " + str(population[i] / area[i]))

Texas : 0.35397753604570975
California : 2.446268439676205

In [48]:
A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 2, 3])
print(A, end="\n\n")
print(B, end="\n\n")
A + B

0    2
1    4
2    6
dtype: int64

1    1
2    3
3    5
dtype: int64

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [49]:
A.add(B, fill_value = 0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [50]:
A.multiply(B, fill_value = 1)

0     2.0
1     4.0
2    18.0
3     5.0
dtype: float64

***Data wrangling***

In [51]:
df

  Province  Year  Literacy  year/literacy  Series
0       FL  2013       0.2   10065.000000       0
1       FL  2014       0.1   20140.000000       1
2       NH  2013       0.5    4026.000000       2
3       NH  2014       0.3    6713.333333       3
4       ZH  2014       0.5    4028.000000       4

In [52]:
df1 = pd.DataFrame(df, columns=["Year", "Province"])
df1

   Year Province
0  2013       FL
1  2014       FL
2  2013       NH
3  2014       NH
4  2014       ZH

In [53]:
df2 = pd.DataFrame({"Province": ["FL", "NH", "ZH"], "Population": ["100000", "200000", "300000"]})
df2

  Province Population
0       FL     100000
1       NH     200000
2       ZH     300000

In [54]:
df1.merge(df2)

   Year Province Population
0  2013       FL     100000
1  2014       FL     100000
2  2013       NH     200000
3  2014       NH     200000
4  2014       ZH     300000

In [55]:
df3 = pd.DataFrame({"province": ["FL", "NH"], "Population": ["100000", "200000"]})
print(df3, end="\n\n")
df.merge(df3, right_on='province', left_on='Province')

  province Population
0       FL     100000
1       NH     200000

  Province  Year  Literacy  year/literacy  Series province Population
0       FL  2013       0.2   10065.000000       0       FL     100000
1       FL  2014       0.1   20140.000000       1       FL     100000
2       NH  2013       0.5    4026.000000       2       NH     200000
3       NH  2014       0.3    6713.333333       3       NH     200000

In [56]:
df4 = pd.DataFrame({"Province": ["FL", "NH", "UT"], "Population": ["100000", "200000", "50000"]})
df.merge(df4, how = 'outer')

  Province    Year  Literacy  year/literacy  Series Population
0       FL  2013.0       0.2   10065.000000     0.0     100000
1       FL  2014.0       0.1   20140.000000     1.0     100000
2       NH  2013.0       0.5    4026.000000     2.0     200000
3       NH  2014.0       0.3    6713.333333     3.0     200000
4       ZH  2014.0       0.5    4028.000000     4.0        NaN
5       UT     NaN       NaN            NaN     NaN      50000

In [57]:
df5 = pd.DataFrame({"Province": ["FL", "NH", "FL"], "Population": ["100000", "200000", "50000"]})
df.merge(df5, how = 'outer')

  Province  Year  Literacy  year/literacy  Series Population
0       FL  2013       0.2   10065.000000       0     100000
1       FL  2013       0.2   10065.000000       0      50000
2       FL  2014       0.1   20140.000000       1     100000
3       FL  2014       0.1   20140.000000       1      50000
4       NH  2013       0.5    4026.000000       2     200000
5       NH  2014       0.3    6713.333333       3     200000
6       ZH  2014       0.5    4028.000000       4        NaN

***Combining data with overlap***

In [58]:
series_a = pd.Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan],
                     index=['f', 'e', 'd', 'c', 'b', 'a'])
series_b = pd.Series(np.arange(len(series_a), dtype=np.float64),
                 index=['f', 'e', 'd', 'c', 'b', 'a'])

In [59]:
print(series_a, end = "\n\n")
print(series_b)

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64

In [60]:
pd.Series(np.where(pd.isnull(series_a), series_b, series_a), index = series_a.index)

f    0.0
e    2.5
d    2.0
c    3.5
b    4.5
a    5.0
dtype: float64

In [61]:
series_a.combine_first(series_b)

f    0.0
e    2.5
d    2.0
c    3.5
b    4.5
a    5.0
dtype: float64